# Общие ошибки
ERROR_1 = 'Неверно указана тема пояснительной записки.'
ERROR_2 = 'Неверно указан шифр пояснительной записки.'
ERROR_3 = 'Факультет, кафедра или профиль указаны неверно.'
ERROR_4 = 'Год написания пояснительной записки указан неверно.'
ERROR_5 = 'Неверно указан номер или дата приказа.'
ERROR_6 = 'Неверно указаны исходные данные пояснительной записки.'

# Оформление текста
ERROR_7 = 'Некорректное форматирование текста.'
ERROR_8 = 'Орфографическая ошибка.'
ERROR_9 = 'Межстрочный интервал задан неверно.'
ERROR_10 = 'Абзационный отступ задан неверно.'

# Заголовки
ERROR_11 = 'Заголовок расположен неверно.'
ERROR_12 = 'В заголовке используется неверный размер шрифта.'
ERROR_13 = 'Заголовок не соответствует содержанию.'

# Список
ERROR_14 = 'Список оформлен неверно.'

# Таблица
ERROR_15 = 'Таблица расположена неверно.'
ERROR_16 = 'Номер таблицы указан неверно.'
ERROR_17 = 'Отсутствует ссылка на таблицу по тексту.'

# Рисунок
ERROR_18 = 'Рисунок расположен неверно.'
ERROR_19 = 'Подрисуночная надпись расположена неверно.'
ERROR_20 = 'Некорректный номер рисунка.'
ERROR_21 = 'Отсутствует ссылка на рисунок по тексту.'

# Формула
ERROR_22 = 'Формула расположена неверно.'
ERROR_23 = 'Номер формулы расположен неверно.'
ERROR_24 = 'Отсутствует ссылка на формулу по тексту.'

# Рамки
ERROR_25 = 'Не выдержан интервал от текста до рамки. ' 
 # <a href="1231231">Пример</a>'
ERROR_26 = 'Неверно указано число листов в основной рамке.'

# Ссылки
ERROR_27 = 'Отсутствуют ссылки на использованные источники.'
ERROR_28 = 'Ссылки на источники оформлены неверно.'
